Repository: PerchunPak/python-template
Catalog: {{ cookiecutter.project_name }}/docs/locale/*/LC_MESSAGES/pages/contributing.po
Languages: uk_ua

source: Contributing
uk_ua: Як Допомогти

source: This file is describing our code style and some other documentation about contributions. You must read it before your first contribution.
uk_ua: Цей файл описує стиль нашого коду та деяку іншу документацію про внески. Ви повинні прочитати його перед тим, як зробити свій перший внесок.

source: Also note that this all is just recommendations, you can use anything in some cases, if it will be better than solution that we propose here. However, we will prefer these recommendations when we will review your contribution.
uk_ua: Також зверніть увагу, що це все лише рекомендації, ви можете використовувати будь-що в окремих випадках, якщо це буде краще, ніж рішення, яке ми тут пропонуємо. Однак, ми віддамо перевагу саме цим рекомендаціям, коли будемо розглядати ваш внесок.

source: This "magic" command collects almost all of our CI. If you're on Windows, try `Chocolatey <https://chocolatey.org>`_ to run ``make``.
uk_ua: Цією "чарівною" командою збираються майже всі наші КІ. Якщо ви на Windows, спробуйте `Chocolatey <https://chocolatey.org>`_ запустити `make``.

source: Also, because of conflict between ``pytest-testmon`` and ``pytest-cov`` we use option ``--no-cov`` in ``pytest``\ , so in this way we give prioritize to ``pytest-testmon``. If you want to generate a report with ``pytest-cov``\ , use ``make test ci=1``.
uk_ua: Також через конфлікт між ``pytest-testmon`` і ``pytest-cov`` ми використовуємо опцію ``--no-cov`` у ``pytest``\ , таким чином ми даємо пріоритет ``pytest-testmon``. Якщо ви хочете згенерувати доклад з допомогою ``pytest-cov``\ , використайте ``make test ci=1``.

source: Code Style
uk_ua: Стиль Коду

source: We use ``black`` for almost all style control. We're also trying to use formatters instead of linters, where it is possible.
uk_ua: Ми використовуємо ``black`` майже для всього контролю стилів. Ми також намагаємося використовувати форматери замість літерів, де це можливо.

source: Furthermore, we also have some rules that ``black`` doesn't cover. It includes:
uk_ua: Крім того, у нас також є правила, які ``black`` не покриває. До них відносяться:

source: Imports
uk_ua: Імпорти

source: We have ``isort`` and ``pycln`` for imports control. The first used for sorting imports, and second, to remove unused imports. All other rules are not covered by linters/formatters etc. You should check those yourself.
uk_ua: Для контролю імпорту у нас є ``isort`` та ``pycln``. Перший використовується для сортування імпортів, а другий - для видалення імпортів, що не використовуються. Всі інші правила не покриваються лінтерами/форматерами тощо. Ви повинні перевіряти їх самостійно.

source: You should use ``import ... as ...`` whenever it's possible, but sometimes ``from ... import ...`` style more useful. For example:
uk_ua: Вам слід використовувати ``import ... as ...``, коли це можливо, але іноді більш корисним є стиль ``from ... import ...``. Наприклад:

source: If you're using only one variable from module, you should use ``from ... import ...``. But if you're using many variables from module, better would be ``import ... as ...``\ :
uk_ua: Якщо ви використовуєте тільки одну змінну з модуля, то слід використовувати ``from ... import ...``. Якщо ж використовується багато змінних з модуля, то краще використовувати ``import ... as ...``\ :

source: But wait, where there is ``as`` actually? You must not use ``as`` when alias will be the same as actual name because in that way type checker add import statement to auto-generated ``__all__`` variable.
uk_ua: Але зачекайте, а де тут власне ``as``? Не можна використовувати ``as``, коли псевдонім буде збігатися з реальним ім'ям, тому що в цьому випадку перевірка типу додасть оператор імпорту до автоматично згенерованої змінної ``__all__``.

source: You should also don't use ``as`` when everything that changes are dots replaced by ``_``. This is just useless.
uk_ua: Так само не варто вживати ``як``, коли все, що змінюється, - це крапки, які замінюються на ``_``. Це просто безглуздо.

source: And finally, when you should use ``as``\ :
uk_ua: І, нарешті, коли слід вживати ``as``:

source: Also, you must specify ``__all__`` variable in all ``__init__.py`` files with any code (not one docstring). Reason of this limitation is that ``pycln`` and docs can't know exactly, do you want to add imports as alias, or this import is for using in code which in this file. ``pycln`` will ignore these imports, and docs will duplicate documentation for anything that you will import.
uk_ua: Також у всіх файлах ``__init__.py`` з будь-яким кодом (не одним doc-рядком) необхідно вказувати змінну ``__all__``. Причиною цього обмеження є те, що ``pycln`` і документація не можуть точно знати, чи ви хочете додати імпорт як псевдонім, чи цей імпорт призначений для використання в коді, який знаходиться в цьому файлі. ``pycln`` проігнорує цей імпорт, а документація продублює документацію для всього, що ви імпортуєте.

source: Docstrings
uk_ua: Док-рядки

source: We're using ``flake8`` for checking docstrings presence and their quality. They later in API documentation. You must write docstrings everywhere, except ``__init__`` methods (not the same as ``__init__.py`` files) because those will not go to documentation.
uk_ua: Ми використовуємо ``flake8`` для перевірки наявності та якості рядків документів. Вони пізніше в документації API. Ви повинні писати рядки документації всюди, крім методів ``__init__`` (не те саме, що ``__init__.py`` файли), тому що вони не потраплять до документації.

source: I also recommend reading `Google styleguide about docstrings <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_ because we're using Google style in docstrings.
uk_ua: Я також рекомендую прочитати `гайд по стилю Google про док-рядки <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_\ , оскільки ми використовуємо стиль Google у док-рядках.

source: Markup
uk_ua: Розмітка

source: Because of Sphinx's limitations, we must use ReST markup in docstrings. This allows us to use cross-references to other functions or even projects.
uk_ua: Через обмеження Sphinx ми вимушені використовувати розмітку ReST у doc-рядках. Це дозволяє нам використовувати перехресні посилання на інші функції або навіть проекти.

source: Read more about `ReST markup <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`_ and `Sphinx's cross-references <https://docs.readthedocs.io/en/stable/guides/cross-referencing-with-sphinx.html>`_.
uk_ua: Докладніше про `розмітку ReST <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`_ і `перехресні посилання у Sphinx <https://docs.readthedocs.io/en/stable/guides/cross-referencing-with-sphinx.html>`_.

source: ``__init__.py`` docstrings
uk_ua: Док-рядки в ``__init­­__.py``

source: They describe a package (folder) with modules (\ ``.py`` files).
uk_ua: Вони описують пакет (папку, package) з модулями (\ ``.py`` файлами, modules).

source: Module, function, class, method based docstrings
uk_ua: Док-рядки у модулі, функції, класі та методі

source: It is a short description of an item. They must follow `Google styleguide about docstrings <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_.
uk_ua: Це короткий опис елемента. Вони повинні відповідати `гайду по стилю Google про док-рядки <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_.

source: Variable-based docstrings
uk_ua: Док-рядки в змінних

source: They must follow in format:
uk_ua: Вони повинні бути у форматі:

source: This applies for the module level, and class attributes in `dataclasses <https://docs.python.org/3/library/dataclasses.html>`_\ /classes generated by `attrs <https://pypi.org/project/attrs/>`_. This won't work in ``__init__`` methods because they don't actually go to documentation. Attributes should be documented in class-based docstring, in ``Attributes`` section.
uk_ua: Це стосується рівня модуля та атрибутів класів у `дата-классах <https://docs.python.org/3/library/dataclasses.html>`_\ /класах, створених за допомогою `attrs <https://pypi.org/project/attrs/>`_. Це не буде працювати в методах ``__init__``, оскільки вони насправді не попадають в документацію. Атрибути повинні бути задокументовані у док-рядках классів, у розділі ``Attributes``.

source: At now, linter doesn't detect them. Better sometimes check that all in API documentation actually documented.
uk_ua: Наразі лінтер їх не виявляє. Краще іноді перевіряти, чи все в документації до API дійсно задокументовано.

source: Translations
uk_ua: Переклади

source: If you don't know languages which we support - left translation on us.
uk_ua: Якщо ви не володієте мовами, які ми підтримуємо - залиште переклад на нас.

source: To update ``.po`` files run ``make translate``\ , after that, you can edit translations in ``.po`` files, which can be found as ``locales/<language's tag>/LC_MESSAGES/messages.po``. After editing, for compilation, you can run one more time ``make translate``.
uk_ua: Для оновлення ``.po`` файлів використайте ``make translate``\ , після цього ви можете редагувати ``.po`` файли, які можуть бути знайдені як ``locales/<тег мови>/LC_MESSAGES/messages.po``. Після редагування, для компіляції ви можете запустити ще один раз ``make translate``.

source: To add new language, use ``pybabel init -i locales/base.pot -l <language's tag> -d locales``.
uk_ua: Для додавання нової мови, використайте ``pybabel init -i locales/base.pot -l <тег мови> -d locales``.

source: P.S. Language's tag it is short name of this language, example ``en`` or ``en_EN``. A full list of supported languages can be found with ``pybabel --list-locales``.
uk_ua: P.S. Тег мови це коротке ім'я цієї мови, наприклад ``en`` або ``en_EN``. Повний список мов які підтримуються може бути знайдений за допомогою ``pybabel --list-locales``.

source: Documentation
uk_ua: Документація

source: We use Sphinx for documentation and `docstrings <#Docstrings>`_ for API documentation. At now, there is no actual styles here, except ``doc8``.
uk_ua: Ми використовуємо Sphinx для документації та `док-рядки <#Док-рядки>`_ для документації API. Наразі тут немає ніяких правил та перевірок, окрім ``doc8``.

source: Other Help
uk_ua: Інша допомога

source: You can contribute by spreading a word about this library. It would also be a huge contribution to write a short article on how you are using this project. You can also share your best practices with us.
uk_ua: Ви можете допомогти розповсюдженням слова про цю бібліотеку. Також було б великою допомогою написати маленьку статтю як ви використовуєте цей проект. Ви також можете поділитися кращими практиками з нами.
